### Grouping the data

In [3]:
import pandas as pd

In [8]:
data = {"Trade": ["AIPA", "CSA", "Drone", "FDT"], 
        "Trainer": ["Sagar", "Srinivas", "Akbar", "Shanti"], 
        "Fee": [100000, 50000, 70000, 150000], 
        "In-charge": ["Ramesh", "Ramesh", "Raghu", "Raghu"]}

df = pd.DataFrame(data)
df

   Trade   Trainer     Fee In-charge  index
0   AIPA     Sagar  100000    Ramesh      1
1    CSA  Srinivas   50000    Ramesh      2
2  Drone     Akbar   70000     Raghu      3
3    FDT    Shanti  150000     Raghu      4

In [10]:
# Group them by course and display fees

group_data = df.groupby('Trade')['Fee'].sum()
print(group_data)

Trade
AIPA     100000
CSA       50000
Drone     70000
FDT      150000
Name: Fee, dtype: int64

In [12]:
# Group them by multiple columns: trade and trainer and display fees

group_data1 = df.groupby(['Trade', 'Trainer'])['Fee'].sum()
print(group_data1)

Trade  Trainer
AIPA   Sagar       100000
CSA    Srinivas     50000
Drone  Akbar        70000
FDT    Shanti      150000
Name: Fee, dtype: int64

In [20]:
group_data2 = df.groupby(['In-charge', 'Trade'])['Fee'].sum()
print(group_data2)

In-charge  Trade
Raghu      Drone     70000
           FDT      150000
Ramesh     AIPA     100000
           CSA       50000
Name: Fee, dtype: int64

In [22]:
group_data3 = df.groupby('In-charge')['Fee'].agg(['sum', 'mean'])
group_data3

              sum      mean
In-charge
Raghu      220000  110000.0
Ramesh     150000   75000.0

In [26]:
# Transformation and filtering in groups

df['Fee Contribution % from incharge'] = df.groupby('In-charge')['Fee'].transform(lambda x:(x/x.sum())*100)
df

   Trade   Trainer     Fee In-charge  index  Fee Contribution % from incharge
0   AIPA     Sagar  100000    Ramesh      1                         66.666667
1    CSA  Srinivas   50000    Ramesh      2                         33.333333
2  Drone     Akbar   70000     Raghu      3                         31.818182
3    FDT    Shanti  150000     Raghu      4                         68.181818

In [31]:
# Filtering data based on a condition

filter_data = df.groupby('Trade').filter(lambda x:x['Fee Contribution % from incharge']>50)
filter_data

  Trade Trainer     Fee In-charge  index  Fee Contribution % from incharge
0  AIPA   Sagar  100000    Ramesh      1                         66.666667
3   FDT  Shanti  150000     Raghu      4                         68.181818